; domain
(define (domain checkers-jumping)
    (:requirements :strips :typing)
    
    (:types
        space
        checker
    )

    (:predicates
        (at ?c - checker ?s - space)
        (empty ?s - space)
        (right-of ?s1 - space ?s2 - space)
        (left-of ?s1 - space ?s2 - space)
        (is-red ?c - checker)
        (is-blue ?c - checker)
    )

    (:action slide-red
        :parameters (?c - checker ?from - space ?to - space)
        :precondition (and 
            (at ?c ?from) 
            (empty ?to) 
            (is-red  ?c) 
            (right-of ?from ?to)
        )
        :effect (and 
            (not (at ?c ?from))
            (at ?c ?to) 
            (not (empty ?to))
            (empty ?from)
        )
    )
    
    (:action slide-blue
        :parameters (?c - checker ?from - space ?to - space)
        :precondition (and 
            (at ?c ?from) 
            (empty ?to) 
            (is-blue ?c) 
            (left-of  ?from ?to)
        )
        :effect (and 
            (not (at ?c ?from))
            (at ?c ?to)
            (not (empty ?to))
            (empty ?from)
        )
    )
    
    (:action jump-red 
        :parameters (?c ?b - checker ?from ?mid ?to - space)
        :precondition (and
            (at ?c ?from)
            (is-red ?c)
            (at ?b ?mid)
            (is-blue  ?b)
            (empty ?to)
            (right-of ?from ?mid)
            (right-of ?mid   ?to)
        )
        :effect (and
            (not (at ?c ?from))
            (at ?c ?to)
            (not (empty ?to))
            (empty ?from)
        )
    )
    
    (:action jump-blue 
        :parameters (?c ?b - checker ?from ?mid ?to - space)
        :precondition (and
            (at ?c ?from)
            (is-blue ?c)
            (at ?b ?mid)
            (is-red  ?b)
            (empty ?to)
            (left-of ?from ?mid)
            (left-of ?mid   ?to)
        )
        :effect (and
            (not (at ?c ?from))
            (at ?c ?to)
            (not (empty ?to))
            (empty ?from)
        )
    )
)

; problem
(define (problem checkers-jumping-prob-2)
  (:domain checkers-jumping)

  (:objects
    space1 space2 space3 space4 space5 - space
    red1 red2 blue1 blue2 - checker
  )

  (:init
    (at red1 space1)
    (at red2 space2)
    (empty space3)
    (at blue1 space4)
    (at blue2 space5)

    (right-of space1 space2)
    (right-of space2 space3)
    (right-of space3 space4)
    (right-of space4 space5)
    (left-of space2 space1)
    (left-of space3 space2)
    (left-of space4 space3)
    (left-of space5 space4)

    (is-red red1)
    (is-red red2)
    (is-blue blue1)
    (is-blue blue2)
  )

  (:goal (and
    (at blue1 space1)
    (at blue2 space2)
    (empty space3)
    (at red1 space4)
    (at red2 space5)
  ))
)

; plan
1. (slide-blue blue1 space4 space3)
   deleted: (at blue1 space4) (empty space3)
   added: (at blue1 space3) (empty space4)
   goals met: 0 of 5
2. (jump-red red2 blue1 space2 space3 space4)
   deleted: (at red2 space2) (empty space4)
   added: (at red2 space4) (empty space2)
   goals met: 0 of 5
3. (slide-red red1 space1 space2)
   deleted: (at red1 space1) (empty space2)
   added: (at red1 space2) (empty space1)
   goals met: 0 of 5
4. (jump-blue blue1 red1 space3 space2 space1)
   deleted: (at blue1 space3) (empty space1)
   added: (at blue1 space1) (empty space3)
   goals met: 2 of 5
5. (jump-blue blue2 red2 space5 space4 space3)
   deleted: (at blue2 space5) (empty space3)
   added: (at blue2 space3) (empty space5)
   goals met: 1 of 5
6. (slide-red red2 space4 space5)
   deleted: (at red2 space4) (empty space5)
   added: (at red2 space5) (empty space4)
   goals met: 2 of 5
7. (jump-red red1 blue2 space2 space3 space4)
   deleted: (at red1 space2) (empty space4)
   added: (at red1 space4) (empty space2)
   goals met: 3 of 5
8. (slide-blue blue2 space3 space2)
   deleted: (at blue2 space3) (empty space2)
   added: (at blue2 space2) (empty space3)
   goals met: 5 of 5
